Revit 2027 API
BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotChangeExtension Property
 Failed to change extension of part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PinnedFabricationPartNotChangeExtension { get; }
Public Shared ReadOnly Property PinnedFabricationPartNotChangeExtension As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PinnedFabricationPartNotChangeExtension {
	FailureDefinitionId^ get ();
}
static member PinnedFabricationPartNotChangeExtension : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace